In [2]:
import pandas as pd
import numpy as np

# Assignment 1: DataFrame Basics

Hi there!

Can you read in the transactions dataset and report on:

* The number of rows and columns
* The names of the columns
* The datatypes of each column

In [3]:
# A common practice is to create a path variable to pass to read_csv
transactions = pd.read_csv("transactions.csv")
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [4]:
#The number of rows and columns
transactions.shape

(83488, 3)

In [5]:
#The names of the columns
transactions.columns

Index(['date', 'store_nbr', 'transactions'], dtype='object')

In [6]:
#The datatypes of each column
transactions.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

# Assignment 2: Exploring DataFrames

Hello!

* Can you quickly inspect the first 5 rows of the transactions data? 

* Then, dive a bit more deeply into the data and check if there are any missing values.
* What about the number of unique dates? I want to make sure we didn’t leave any out.
* Finally, can you report the mean, median, min and max of “transactions”?  I want to check for any anomalies in our data.

In [7]:
#Can you quickly inspect the first 5 rows of the transactions data?
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [10]:
#Then, dive a bit more deeply into the data and check if there are any missing values.
transactions.isna().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [13]:
#What about the number of unique dates? I want to make sure we didn’t leave any out.
transactions.nunique(dropna=False)

date            1682
store_nbr         54
transactions    4993
dtype: int64

In [19]:
#Finally, can you report the mean, median, min and max of “transactions”? I want to check for any anomalies in our data.
print('The min is: ',transactions.transactions.min())
print('The max is: ',transactions.transactions.max())
print('The mean is: ',transactions.transactions.mean())
print('The median is: ',transactions.transactions.median())

The min is:  5
The max is:  8359
The mean is:  1694.6021583940208
The median is:  1393.0

In [20]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [21]:
transactions.describe(include='all')

              date     store_nbr  transactions
count        83488  83488.000000  83488.000000
unique        1682           NaN           NaN
top     2017-07-29           NaN           NaN
freq            54           NaN           NaN
mean           NaN     26.939237   1694.602158
std            NaN     15.608204    963.286644
min            NaN      1.000000      5.000000
25%            NaN     13.000000   1046.000000
50%            NaN     27.000000   1393.000000
75%            NaN     40.000000   2079.000000
max            NaN     54.000000   8359.000000

# Exercise 3 - Accessing DataFrames

Hi, starting to dive deeper into this data.

I noticed that the first row is the only one from 2013-01-01.

* Can you get me a copy of the DataFrame that excludes that row, and only includes “store_nbr” and “transactions”?
* Also, can you report the number of unique store numbers?
* Finally, return the total number of transactions in millions

In [22]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [27]:
#Can you get me a copy of the DataFrame that excludes that row, and only includes “store_nbr” and “transactions”?
transactions[transactions['date'] != '2013-01-01'].head()

         date  store_nbr  transactions
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922
5  2013-01-02          5          1903

In [29]:
#Also, can you report the number of unique store numbers?
transactions['store_nbr'].nunique()

54

In [31]:
#Finally, return the total number of transactions in millions
transactions['transactions'].sum() / 1000000

np.float64(141.478945)

# Assignment 4: Dropping Data and Duplicates

Hi there!

Can you:

1. Drop the first row of data? We want it permanently removed. 
2. Drop the date column but not in place
3. Return a dataframe that only includes the last row for each of the stores.

Thanks!

In [26]:
# Drop the first row of data? We want it permanently removed
transactions.drop(0, axis=0, inplace=True)
transactions.head()

         date  store_nbr  transactions
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922
5  2013-01-02          5          1903

In [27]:
# Drop the date column but not in place
transactions.drop('date', axis=1).head()

   store_nbr  transactions
1          1          2111
2          2          2358
3          3          3487
4          4          1922
5          5          1903

In [28]:
#Return a dataframe that only includes the last row for each of the stores.
transactions.drop_duplicates(subset='store_nbr',keep='last').head()

             date  store_nbr  transactions
83434  2017-08-15          1          1693
83435  2017-08-15          2          1737
83436  2017-08-15          3          2956
83437  2017-08-15          4          1283
83438  2017-08-15          5          1310

# Assignment 5: Missing Data

Hello, 

Can you tell if any dates or prices are missing in the oil dataset?

Then compare the mean of the oil series when filling in with mean vs. filling in with 0.

Thanks!

In [31]:
oil = pd.read_csv("oil.csv")
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [33]:
oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [37]:
oil['dcoilwtico'].fillna(0).mean()

np.float64(65.32379310344828)

In [36]:
oil['dcoilwtico'].fillna(oil['dcoilwtico'].mean()).mean()

np.float64(67.71436595744682)

# Assignment 6: Filtering DataFrames (REFAZER)

I need some quick research on store 25:

* First, calculate the percentage of times ALL stores had more than 2000 transactions
* Then, calculate the percentage of times store 25 had more than 2000 transactions, and calculate the sum of transactions on these days
* Finally, sum the transactions for stores 25 and 31, that occurred in May or June, and had less than 2000 transactions

In [65]:
transactions = pd.read_csv("transactions.csv", parse_dates=['date'])
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [113]:
# First, calculate the percentage of times ALL stores had more than 2000 transactions.
print((transactions["transactions"] > 2000).mean())

0.26680481027213493

In [102]:
# Then, calculate the percentage of times store 25 had more than 2000 transactions, and calculate the sum of transactions on these days.
mask = transactions.query("store_nbr == 25 and transactions > 2000")

print(mask['transactions'].sum())

144903

In [103]:
# Finally, sum the transactions for stores 25 and 31, that occurred in May or June, and had less than 2000 transactions.
mask = transactions.query("store_nbr == (25, 31) and date.dt.month == [5, 6] and transactions < 2000")

print(mask['transactions'].sum())

644910

# Assignment 7: Sorting DataFrames

Hi there,
* Can you get me a dataset that includes the 5 days with the highest transactions counts? Any similarities between them?
* Then, can you get me a dataset sorted by date from earliest to most recent, but with the highest transactions first and the lowest transactions last for each day?
* Finally, sort the columns in reverse alphabetical order. 

Thanks!

In [4]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [6]:
#Can you get me a dataset that includes the 5 days with the highest transactions counts? Any similarities between them?
transactions.sort_values('transactions', ascending=False).head()
#all transactions happened close to Christimas and almost in the same store

             date  store_nbr  transactions
52011  2015-12-23         44          8359
71010  2016-12-23         44          8307
16570  2013-12-23         44          8256
33700  2014-12-23         44          8120
16572  2013-12-23         46          8001

In [10]:
#Then, can you get me a dataset sorted by date from earliest to most recent, but with the highest transactions first and the lowest transactions last for each day?
transactions.sort_values(['date','transactions'], ascending=[True, False]).head()

          date  store_nbr  transactions
0   2013-01-01         25           770
40  2013-01-02         46          4886
38  2013-01-02         44          4821
39  2013-01-02         45          4208
41  2013-01-02         47          4161

In [12]:
#Finally, sort the columns in reverse alphabetical order.
transactions.sort_index(axis=1, ascending=False).head()

   transactions  store_nbr        date
0           770         25  2013-01-01
1          2111          1  2013-01-02
2          2358          2  2013-01-02
3          3487          3  2013-01-02
4          1922          4  2013-01-02

# Assignment 8: Modifying Columns

Just some quick work, but can you send me the transaction data with the columns renamed?

* Rename `transactions` to `transaction_count` and `store_nbr` to `store_number`.
* Reorder the columns so date is first, then store number, then transaction count.

Thanks!

In [16]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [17]:
#Rename transactions to transaction_count and store_nbr to store_number.
transactions.columns= ['date','transaction_count','store_number']

transactions.head()

         date  transaction_count  store_number
0  2013-01-01                 25           770
1  2013-01-02                  1          2111
2  2013-01-02                  2          2358
3  2013-01-02                  3          3487
4  2013-01-02                  4          1922

In [18]:
#Reorder the columns so date is first, then store number, then transaction count.
transactions.reindex(['date','store_number','transaction_count'], axis=1).head()

         date  store_number  transaction_count
0  2013-01-01           770                 25
1  2013-01-02          2111                  1
2  2013-01-02          2358                  2
3  2013-01-02          3487                  3
4  2013-01-02          1922                  4

# Assignment 9: Column Creation

Just some quick work, but can you send me the transaction data with the columns renamed?

* Create a `pct_to_target` column that divides transactions by 2500.
* Then, create a `met_target` column that returns True if `pct_to_target` is greater than or equal to 1.
* Next, create a `bonus_payable` column that equals 100 if `met_target` is True, and 0 if not. Then sum the bonus payable column.
* Finally, create columns for month and day of week as integers. There is some helper code for these dateparts below.



Thanks!

In [8]:
transactions = pd.read_csv('transactions.csv')

transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [11]:
# Create a pct_to_target column that divides transactions by 2500.

transactions['pct_to_target'] = transactions.loc[:, 'transactions'] / 2500

transactions.head()

         date  store_nbr  transactions  pct_to_target
0  2013-01-01         25           770         0.3080
1  2013-01-02          1          2111         0.8444
2  2013-01-02          2          2358         0.9432
3  2013-01-02          3          3487         1.3948
4  2013-01-02          4          1922         0.7688

In [13]:
# Then, create a met_target column that returns True if pct_to_target is greater than or equal to 1.

transactions['met_target'] = transactions.loc[:, 'pct_to_target'] >= 1

transactions.head()

         date  store_nbr  transactions  pct_to_target  met_target
0  2013-01-01         25           770         0.3080       False
1  2013-01-02          1          2111         0.8444       False
2  2013-01-02          2          2358         0.9432       False
3  2013-01-02          3          3487         1.3948        True
4  2013-01-02          4          1922         0.7688       False

In [21]:
# Next, create a bonus_payable column that equals 100 if met_target is True, and 0 if not. Then sum the bonus payable column.
transactions['bonus_payble'] = np.where(transactions['met_target'] == True, 100, 0)

transactions.head()

print(transactions['bonus_payble'].sum())

1448300

In [31]:
#Finally, create columns for month and day of week as integers. There is some helper code for these date parts below.
transactions['month'] = transactions['date'].str[5:7]

transactions.head()

,date,store_nbr,transactions,pct_to_target,met_target,bonus_payble,month
0,2013-01-01,25,770,0.3080,False,0,01
1,2013-01-02,1,2111,0.8444,False,0,01
2,2013-01-02,2,2358,0.9432,False,0,01
3,2013-01-02,3,3487,1.3948,True,100,01
4,2013-01-02,4,1922,0.7688,False,0,01

# Assignment 10: np.select

Hi there! I need a few columns created.

1. Create a ‘seasonal_bonus’ column that applies to these dates: 
    * All days in December (month = 12)
    * Sundays (day_of_week = 6) in May (month = 5)
    * Mondays (day_of_week = 0) in July (month = 7)
2. Call the December bonus ‘Holiday Bonus’, the May bonus ‘Corporate Month’, and the July bonus ‘Summer Special’. If no bonus applies, the column should display ‘None’. 
3. Finally, calculate the total bonus owed at $100 per day.

Thanks!

In [11]:
transactions = pd.read_csv('transactions.csv')

transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [18]:
conditions = [
    (transactions['date'].str[5:7] == '12'),
    (transactions['date'].str[5:7] == '05'),
    (transactions['date'].str[5:7] == '07')
]

choices = ['Holiday Bonus', 'Corporate Month', 'Summer Special']

transactions['seasonal_bonus'] = np.select(conditions, choices, default='none')

transactions['seasonal_bonus'].value_counts()

seasonal_bonus
none               61970
Summer Special      7773
Corporate Month     7717
Holiday Bonus       6028
Name: count, dtype: int64

In [20]:
transactions['date'].str[5:7] == '05'

0        False
1        False
2        False
3        False
4        False
         ...
83483    False
83484    False
83485    False
83486    False
83487    False
Name: date, Length: 83488, dtype: bool

# Assignment 11: Assign 

* Drop the columns that have been created so far (keep only date, store_number, and transaction count), and recreate them using the assign method.
* Then sum the seasonal bonus owed once again to make sure the numbers are correct.

In [ ]:
# Drop columns we created in prior exercises

In [61]:
transactions = pd.read_csv(
    r"C:\Users\User\OneDrive\Documentos\Data_Analytcs\Python\Pandas_Course_Resources\Pandas\retail\transactions.csv")

transactions.date.str[-2:]

0        01
1        02
2        02
3        02
4        02
         ..
83483    15
83484    15
83485    15
83486    15
83487    15
Name: date, Length: 83488, dtype: object

In [ ]:
'''
Create a pct_to_target column that divides transactions by 2500.
Then, create a met_target column that returns True if pct_to_target is greater than or equal to 1.
Next, create a bonus_payable column that equals 100 if met_target is True, and 0 if not. Then sum the bonus payable column.
Finally, create columns for month and day of week as integers. There is some helper code for these dateparts below.
'''

In [63]:
# Create same columns with assign
transactions = transactions.assign(
    pct_to_target = transactions["transactions"] / 2500,
    met_target = lambda transactions: transactions["pct_to_target"] > 1,
    bonus_payble = lambda transactions: np.where(transactions["met_target"] == True, 100, 0),
    month = lambda transactions: transactions["date"].str[5:7],
    day = lambda transactions: transactions["date"].str[-2:]
)

transactions.head()

,date,store_nbr,transactions,pct_to_target,met_target,bonus_payble,month,day
0,2013-01-01,25,770,0.3080,False,0,01,01
1,2013-01-02,1,2111,0.8444,False,0,01,02
2,2013-01-02,2,2358,0.9432,False,0,01,02
3,2013-01-02,3,3487,1.3948,True,100,01,02
4,2013-01-02,4,1922,0.7688,False,0,01,02

In [ ]:
'''
Create a ‘seasonal_bonus’ column that applies to these dates:
All days in December (month = 12)
Sundays (day_of_week = 6) in May (month = 5)
Mondays (day_of_week = 0) in July (month = 7)
Call the December bonus ‘Holiday Bonus’, the May bonus ‘Corporate Month’, and the July bonus ‘Summer Special’. If no bonus applies, the column should display ‘None’.
Finally, calculate the total bonus owed at $100 per day.
'''

In [68]:
transactions = transactions.assign(
    seasonal_bonus = np.where(transactions["month"] == "12", "Holiday Bonus", 
    np.where((transactions["month"]== "05") & (transactions["day"] == "06"), "Corporate Month",
    np.where(transactions["month"]== "07" , "Summer Special", "None")
)))   
 
transactions.head()

transactions.head()

,date,store_nbr,transactions,pct_to_target,met_target,bonus_payble,month,day,seasonal_bonus
0,2013-01-01,25,770,0.3080,False,0,01,01,None
1,2013-01-02,1,2111,0.8444,False,0,01,02,None
2,2013-01-02,2,2358,0.9432,False,0,01,02,None
3,2013-01-02,3,3487,1.3948,True,100,01,02,None
4,2013-01-02,4,1922,0.7688,False,0,01,02,None

# Assignment 12: Memory Optimization

Reduce the memory usage of the transactions DataFrame to below 5MB.

In [71]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [ ]:
transactions.info(memory_usage="deep")

In [98]:
transactions = pd.read_csv(
    r"C:\Users\User\OneDrive\Documentos\Data_Analytcs\Python\Pandas_Course_Resources\Pandas\retail\transactions.csv", parse_dates=["date"])

transactions.head()

        date  store_nbr  transactions
0 2013-01-01         25           770
1 2013-01-02          1          2111
2 2013-01-02          2          2358
3 2013-01-02          3          3487
4 2013-01-02          4          1922

In [99]:
transactions["transactions"] = transactions["transactions"].astype("int32")
transactions["store_nbr"] = transactions["store_nbr"].astype("category")

transactions.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  category
 2   transactions  83488 non-null  int32
dtypes: category(1), datetime64[ns](1), int32(1)
memory usage: 1.0 MB

In [100]:
transactions.head()

        date store_nbr  transactions
0 2013-01-01        25           770
1 2013-01-02         1          2111
2 2013-01-02         2          2358
3 2013-01-02         3          3487
4 2013-01-02         4          1922